---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AllowLargeGeometry
source: html/4b5a3532-d4f3-4cc3-ca7f-d75cb3ba719f.htm
---
# Autodesk.Revit.DB.Analysis.AllowLargeGeometry

An enumerated type containing settings information related to handling of large geometries.

## Syntax (C#)
```csharp
public enum AllowLargeGeometry
```